In [1]:
import numpy as np
import pandas as pd

In [53]:
import datetime

### Importing data

In [4]:
d1 = pd.read_csv("E:/Projects/2022_05/Dormant_Activation/Dormant_Analysis/Account_Status_mar22.csv")

In [5]:
d2 = pd.read_csv("E:/Projects/2022_05/Dormant_Activation/Dormant_Analysis/Balance_Buildup_Demographics_cust_mar22.csv")

In [6]:
d3 = pd.read_csv("E:/Projects/2022_05/Dormant_Activation/Dormant_Analysis/Balance_Buildup_Demographics1_mar22.csv")

In [7]:
d4 = pd.read_csv("E:/Projects/2022_05/Dormant_Activation/Dormant_Analysis/Balance_buildup_txn_JFM22.csv")

In [8]:
d5 = pd.read_csv("E:/Projects/2022_05/Dormant_Activation/Dormant_Analysis/PPC_MAR22.csv")

In [113]:
d5.head()

,CUST_ID,ACCT_NO,CA,SB,RD,TD,TD_BAL,JEWEL_LOAN,HL_PL_LAP_4WL_2WL,DIG
0,10923710,1208155000163264,0,1,0,0,0,0,0,0
1,15503072,1339155000029990,0,1,0,0,0,0,0,0
2,10525978,1741155000003190,0,1,0,0,0,2,0,0
3,21207635,1739155000067739,0,1,0,0,0,0,0,0
4,6268562,1477155000002133,0,1,0,0,0,0,0,0

### Data Spliting

In [10]:
d1[['ACCT_NO','ACCT_STAT']] = d1['DATAPOINTS'].str.split('|',expand = True)

In [14]:
d1 = d1.drop(['DATAPOINTS'],axis =1)

In [20]:
d1.head()

            ACCT_NO ACCT_STAT
0  1630173000001143         7
1  1828173000000956         7
2  1273173000002614         8
3  1246177000002444         8
4  1661173000002793         8

In [35]:
d1.shape

(4876072, 2)

In [16]:
d2[['CUST_ID','ACCT_NO','DAT_CUST_OPEN','FLG_STAFF','DAT_BIRTH_CUST','TXT_CUST_SEX','COD_CUST_MARSTAT']] = d2['DATA_POINTS'].str.split('|',expand = True)

In [17]:
d2 = d2.drop(['DATA_POINTS'],axis = 1)

In [19]:
d2.head()

,CUST_ID,ACCT_NO,DAT_CUST_OPEN,FLG_STAFF,DAT_BIRTH_CUST,TXT_CUST_SEX,COD_CUST_MARSTAT
0,8665085,1473155000062860,2012-07-19,N,1979-02-12,M,2
1,9463999,1709155000003774,2012-12-06,N,1986-06-09,M,2
2,10448555,1698172000001624,2013-10-03,N,1964-05-27,M,2
3,7564978,1419162000000642,2011-12-05,N,2010-07-26,F,1
4,14322294,1192155000099073,2016-11-28,N,1995-07-16,F,1

In [36]:
d2.shape

(4898441, 7)

In [23]:
d3[['V_LOGIC_DIV','ACCT_NO','D_OPEN_DATE','V_CUST_TYPE','CUST_PROFESSION','FALL_BACK_BAL']] = d3['DATA_POINTS'].str.split('|',expand = True)

In [25]:
d3 = d3.drop('DATA_POINTS', axis = 1)

In [26]:
d3.head()

,V_LOGIC_DIV,ACCT_NO,D_OPEN_DATE,V_CUST_TYPE,CUST_PROFESSION,FALL_BACK_BAL
0,AHMEDABAD,2201155000052410,2014-03-27,R,BUSINESS,1177
1,AHMEDABAD,2201162000000591,2013-08-01,R,BANKER,40804
2,AHMEDABAD,2201155000051943,2014-01-04,R,SERVICE - OTHERS,424610
3,AHMEDABAD,2201155000051955,2014-01-06,R,SERVICE - OTHERS,57126
4,AHMEDABAD,2201155000052280,2014-03-04,R,SERVICE - PRIVATE SECTOR,3114

In [38]:
d3.shape

(4875376, 6)

In [28]:
d4[['ACCT_NO','MAX_AVG_BALANCE','AVG_AMT_ADB_PRODUCT','MAX_AMT_TOT_CR','AVG_AMT_TOT_CR','SUM_AMT_TOT_CR','MAX_AMT_TOT_DR',
    'AVG_AMT_TOT_DR','SUM_AMT_TOT_DR','SUM_CTR_TOT_CR','SUM_CTR_TOT_DR','MAX_CTR_TOT_CR','MAX_CTR_TOT_DR',
   'AVG_CTR_TOT_CR','AVG_CTR_TOT_DR']] = d4['AVG_BAL'].str.split('|', expand = True)

In [29]:
d4 = d4.drop('AVG_BAL', axis = 1)

In [30]:
d4.head()

,ACCT_NO,MAX_AVG_BALANCE,AVG_AMT_ADB_PRODUCT,MAX_AMT_TOT_CR,AVG_AMT_TOT_CR,SUM_AMT_TOT_CR,MAX_AMT_TOT_DR,AVG_AMT_TOT_DR,SUM_AMT_TOT_DR,SUM_CTR_TOT_CR,SUM_CTR_TOT_DR,MAX_CTR_TOT_CR,MAX_CTR_TOT_DR,AVG_CTR_TOT_CR,AVG_CTR_TOT_DR
0,1267155000247576,1248,1237,31506,14665,43994,31492,14664,43993,18,53,11,31,6,18
1,1234155000000653,64621,64785,849183,660911,1982734,852677,660810,1982429,53,42,20,19,18,14
2,1405166000014874,361,366,8250,7917,23752,16000,10669,32006,4,5,2,2,1,2
3,1406155000092986,1000,1000,6,2,6,6,2,6,1,1,1,1,0,0
4,1249155000143421,2302,2282,95605,55258,165774,103559,55126,165378,26,72,10,33,9,24

In [39]:
d4.shape

(4897935, 15)

In [32]:
d5[['CUST_ID','ACCT_NO','CA','SB','RD','TD','TD_BAL','JEWEL_LOAN','HL_PL_LAP_4WL_2WL','DIG']] = d5['DATA_POINTS'].str.split('|', expand = True)

In [33]:
d5 = d5.drop('DATA_POINTS', axis = 1)

In [34]:
d5.head()

,CUST_ID,ACCT_NO,CA,SB,RD,TD,TD_BAL,JEWEL_LOAN,HL_PL_LAP_4WL_2WL,DIG
0,10923710,1208155000163264,0,1,0,0,0,0,0,0
1,15503072,1339155000029990,0,1,0,0,0,0,0,0
2,10525978,1741155000003190,0,1,0,0,0,2,0,0
3,21207635,1739155000067739,0,1,0,0,0,0,0,0
4,6268562,1477155000002133,0,1,0,0,0,0,0,0

In [40]:
d5.shape

(4898247, 10)

### Data Merging

In [94]:
data = d1.merge(d2, on = 'ACCT_NO', how = 'left')

In [95]:
data = data.merge(d3, on = 'ACCT_NO', how = 'left')

In [96]:
data = data.merge(d4, on = 'ACCT_NO', how = 'left')

In [97]:
data = data.merge(d5, on = 'ACCT_NO', how = 'left')

In [98]:
for col in data.columns:
    print(col)

ACCT_NO
ACCT_STAT
CUST_ID_x
DAT_CUST_OPEN
FLG_STAFF
DAT_BIRTH_CUST
TXT_CUST_SEX
COD_CUST_MARSTAT
V_LOGIC_DIV
D_OPEN_DATE
V_CUST_TYPE
CUST_PROFESSION
FALL_BACK_BAL
MAX_AVG_BALANCE
AVG_AMT_ADB_PRODUCT
MAX_AMT_TOT_CR
AVG_AMT_TOT_CR
SUM_AMT_TOT_CR
MAX_AMT_TOT_DR
AVG_AMT_TOT_DR
SUM_AMT_TOT_DR
SUM_CTR_TOT_CR
SUM_CTR_TOT_DR
MAX_CTR_TOT_CR
MAX_CTR_TOT_DR
AVG_CTR_TOT_CR
AVG_CTR_TOT_DR
CUST_ID_y
CA
SB
RD
TD
TD_BAL
JEWEL_LOAN
HL_PL_LAP_4WL_2WL
DIG

In [99]:
data = data.drop('CUST_ID_y',axis = 1)

In [100]:
data = data.rename(columns={'CUST_ID_x':'CUST_ID'})

In [101]:
data.head()

,ACCT_NO,ACCT_STAT,CUST_ID,DAT_CUST_OPEN,FLG_STAFF,DAT_BIRTH_CUST,TXT_CUST_SEX,COD_CUST_MARSTAT,V_LOGIC_DIV,D_OPEN_DATE,...,AVG_CTR_TOT_CR,AVG_CTR_TOT_DR,CA,SB,RD,TD,TD_BAL,JEWEL_LOAN,HL_PL_LAP_4WL_2WL,DIG
0,1630173000001143,7,14628733,2017-07-20,N,1955-07-10,F,2,SALEM,2017-07-20,...,0,0,0,1,0,0,0,0,0,0
1,1828173000000956,7,15213816,2017-06-30,N,1950-09-14,F,2,MADURAI,2017-06-30,...,0,0,0,1,0,0,0,0,0,0
2,1273173000002614,8,3535854,2006-02-20,N,1956-06-15,M,2,MADURAI,2019-04-04,...,2,0,0,1,0,0,0,0,0,0
3,1246177000002444,8,13286933,2015-10-08,Y,1986-12-22,F,2,SALEM,2019-02-07,...,2,15,0,2,0,0,0,0,0,0
4,1661173000002793,8,18101688,2019-05-07,N,1946-01-30,M,2,TRICHY,2019-05-07,...,1,1,0,1,0,0,0,0,0,0

### String to date and Vintage

In [102]:
data['DAT_CUST_OPEN'] = pd.to_datetime(data['DAT_CUST_OPEN'])
data['DAT_BIRTH_CUST'] = pd.to_datetime(data['DAT_BIRTH_CUST'], errors = 'coerce')
data['D_OPEN_DATE'] = pd.to_datetime(data['D_OPEN_DATE'])

In [103]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4877176 entries, 0 to 4877175
Data columns (total 35 columns):
 #   Column               Dtype
---  ------               -----
 0   ACCT_NO              object
 1   ACCT_STAT            object
 2   CUST_ID              object
 3   DAT_CUST_OPEN        datetime64[ns]
 4   FLG_STAFF            object
 5   DAT_BIRTH_CUST       datetime64[ns]
 6   TXT_CUST_SEX         object
 7   COD_CUST_MARSTAT     object
 8   V_LOGIC_DIV          object
 9   D_OPEN_DATE          datetime64[ns]
 10  V_CUST_TYPE          object
 11  CUST_PROFESSION      object
 12  FALL_BACK_BAL        object
 13  MAX_AVG_BALANCE      object
 14  AVG_AMT_ADB_PRODUCT  object
 15  MAX_AMT_TOT_CR       object
 16  AVG_AMT_TOT_CR       object
 17  SUM_AMT_TOT_CR       object
 18  MAX_AMT_TOT_DR       object
 19  AVG_AMT_TOT_DR       object
 20  SUM_AMT_TOT_DR       object
 21  SUM_CTR_TOT_CR       object
 22  SUM_CTR_TOT_DR       object
 23  MAX_CTR_TOT_CR       object
 24  MAX_CTR_TOT_DR       object
 25  AVG_CTR_TOT_CR       object
 26  AVG_CTR_TOT_DR       object
 27  CA                   object
 28  SB                   object
 29  RD                   object
 30  TD                   object
 31  TD_BAL               object
 32  JEWEL_LOAN           object
 33  HL_PL_LAP_4WL_2WL    object
 34  DIG                  object
dtypes: datetime64[ns](3), object(32)
memory usage: 1.3+ GB

In [105]:
data['DAT_CUST_OPEN'] = data.apply(lambda data: (datetime.datetime.strptime('2022-03-31', '%Y-%m-%d') - data['DAT_CUST_OPEN']).days/365, axis = 1)
data['DAT_BIRTH_CUST'] = data.apply(lambda data: (datetime.datetime.strptime('2022-03-31', '%Y-%m-%d') - data['DAT_BIRTH_CUST']).days/365, axis = 1)
data['D_OPEN_DATE'] = data.apply(lambda data: (datetime.datetime.strptime('2022-03-31', '%Y-%m-%d') - data['D_OPEN_DATE']).days/365, axis = 1)

In [106]:
data.head()

,ACCT_NO,ACCT_STAT,CUST_ID,DAT_CUST_OPEN,FLG_STAFF,DAT_BIRTH_CUST,TXT_CUST_SEX,COD_CUST_MARSTAT,V_LOGIC_DIV,D_OPEN_DATE,...,AVG_CTR_TOT_CR,AVG_CTR_TOT_DR,CA,SB,RD,TD,TD_BAL,JEWEL_LOAN,HL_PL_LAP_4WL_2WL,DIG
0,1630173000001143,7,14628733,4.698630,N,66.769863,F,2,SALEM,4.698630,...,0,0,0,1,0,0,0,0,0,0
1,1828173000000956,7,15213816,4.753425,N,71.591781,F,2,MADURAI,4.753425,...,0,0,0,1,0,0,0,0,0,0
2,1273173000002614,8,3535854,16.117808,N,65.835616,M,2,MADURAI,2.991781,...,2,0,0,1,0,0,0,0,0,0
3,1246177000002444,8,13286933,6.482192,Y,35.295890,F,2,SALEM,3.145205,...,2,15,0,2,0,0,0,0,0,0
4,1661173000002793,8,18101688,2.901370,N,76.216438,M,2,TRICHY,2.901370,...,1,1,0,1,0,0,0,0,0,0

### EDA

In [108]:
data.ACCT_STAT.unique()

array(['7', '8', '2', '3', '5', '17', '10', '11', '4', '16', '18', '19',
       '12', '6'], dtype=object)

In [ ]:
6 and 8 active

In [ ]:
7 Dormant